src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/Модель_Документ_ПриходКлиентСервер/Module.bsl
#Область Интерфейс_МодульМодели
Процедура ПриВыполненииОбработчиков(КонтекстИзменений) Экспорт
	Если глМодель_ВыполнятьДействие(КонтекстИзменений, "ОбновитьИтоги", "Товары") Тогда
		Если НЕ глМодель_РеквизитыИзменены(КонтекстИзменений, "Товары") Тогда
			СоответствиеНомерСтроки = Новый Соответствие;
			Для Каждого СтрокаТаблицы Из глМодель_ПолучитьИзмененныеСтроки(КонтекстИзменений, "Товары") Цикл
				СоответствиеНомерСтроки.Вставить(СтрокаТаблицы.НомерСтроки);
			КонецЦикла;
			
			глМодель_УстановитьПараметрДействия(КонтекстИзменений, "НомераСтрок", глМодель_ПолучитьКлючи(СоответствиеНомерСтроки));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриВыполненииОбработчиковСтроки(КонтекстИзменений, ДанныеСтроки) Экспорт
	Если глМодель_ВыполнятьОбработчикСтроки(КонтекстИзменений, ДанныеСтроки, "Сумма", "Количество,Цена") Тогда
		ДанныеСтроки.Сумма = ДанныеСтроки.Количество * ДанныеСтроки.Цена;
	КонецЕсли;
		
	Если глМодель_ВыполнятьОбработчикСтроки(КонтекстИзменений, ДанныеСтроки, "СуммаРегл", "Сумма") Тогда
		ДанныеСтроки.СуммаРегл = ДанныеСтроки.Сумма * глМодель_ПолучитьСвойство(КонтекстИзменений, "КоэффициентПересчетаСуммаРегл");
	КонецЕсли;
		
	Если глМодель_ВыполнятьОбработчикСтроки(КонтекстИзменений, ДанныеСтроки, "СуммаЗакупки", "Количество,ЦенаЗакупки") Тогда
		ДанныеСтроки.СуммаЗакупки = ДанныеСтроки.Количество * ДанныеСтроки.ЦенаЗакупки;
	КонецЕсли;
		
	Если глМодель_ВыполнятьОбработчикСтроки(КонтекстИзменений, ДанныеСтроки, "Наценка", "Сумма,СуммаЗакупки") Тогда
		Если ДанныеСтроки.СуммаЗакупки = 0 Тогда
			ДанныеСтроки.Наценка = 0;
		Иначе
			ДанныеСтроки.Наценка = (ДанныеСтроки.Сумма - ДанныеСтроки.СуммаЗакупки) / ДанныеСтроки.СуммаЗакупки * 100;
		КонецЕсли;
	КонецЕсли;
		
	Если глМодель_ВыполнятьОбработчикСтроки(КонтекстИзменений, ДанныеСтроки, "Цена", "Номенклатура,[ТипНоменклатуры]", Истина) Тогда
		#Если НЕ Клиент ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
		ТаблицаСтроки = РегистрыСведений.ЦеныНоменклатуры.СрезПоследних(глМодель_Данные(КонтекстИзменений).Дата, Новый Структура("Номенклатура", ДанныеСтроки.Номенклатура));
		Если ТаблицаСтроки.Количество() > 0 Тогда
			ДанныеСтроки.Цена = ТаблицаСтроки[0].Цена;
		Иначе
			ДанныеСтроки.Цена = 0;
		КонецЕсли;
		#КонецЕсли
	КонецЕсли;
		
	Если глМодель_ВыполнятьОбработчикСтроки(КонтекстИзменений, ДанныеСтроки, "Цена", "Сумма,Количество") Тогда
		Если ДанныеСтроки.Количество = 0 Тогда
			ДанныеСтроки.Цена = ДанныеСтроки.Сумма;
		Иначе
			ДанныеСтроки.Цена = ДанныеСтроки.Сумма / ДанныеСтроки.Количество;
		КонецЕсли;
	КонецЕсли;
		
	Если глМодель_ВыполнятьОбработчикСтроки(КонтекстИзменений, ДанныеСтроки, "ЦенаЗакупки", "СуммаЗакупки,Количество") Тогда
		Если ДанныеСтроки.Количество = 0 Тогда
			ДанныеСтроки.ЦенаЗакупки = ДанныеСтроки.СуммаЗакупки;
		Иначе
			ДанныеСтроки.ЦенаЗакупки = ДанныеСтроки.СуммаЗакупки / ДанныеСтроки.Количество;
		КонецЕсли;
	КонецЕсли;
	
	глМодель_ОбновлятьСвойстваСтроки(КонтекстИзменений, ДанныеСтроки, "ТипНоменклатуры", "Номенклатура");
	глМодель_ОбновлятьСвойстваСтроки(КонтекстИзменений, ДанныеСтроки, "ДлинаТипаНоменклатуры", "[ТипНоменклатуры]");
КонецПроцедуры
#КонецОбласти
